// Дана строка, состоящая из N попарно различных символов. 
//Требуется вывести все перестановки символов данной строки.

// xo => xo, ox;

Console.Clear();

Console.Write("Введите символы для перестановки: ");
string str = Console.ReadLine();

